# تغيرها حسب الامر
TADMIN = """

الامر:  `.ح عام`

الشرح:  يستخدم هذا الأمر لحظر الشخص من جميع المجموعات الانته فيها ادمن .
الاستخدام:  بالرد على الشخص او يوزر الشخص او الايدي .


الامر:  `.الغاء ح عام`

الشرح:  يستخدم هذا الأمر لالغاء حظر الشخص من جميع المجموعات الانته فيها ادمن .
الاستخدام:  بالرد على الشخص او يوزر الشخص او الايدي .


الامر:  `.المحظورين عام`

الشرح:  يستخدم هذا الأمر لعرض المحظورين عام .
الاستخدام:  فقط ارسل الامر .

- - - - - - - - - - - - - - - - - - """

TADMIN = """

الامر:  `.ح مؤقت`

الشرح:  يستخدم هذا الأمر لحظر الشخص مؤقتا على حسب المده المحدده .
الاستخدام:  بالرد على الشخص او يوزر الشخص او الايدي .
مثال : `.ح مؤقت @SA3ED_IT 5m` .

m = دقيقه
h = ساعه
d = يوم
w = اسبوع


الامر:  `.الغاء حظر`

الشرح:  يستخدم هذا الأمر لالغاء حظر الشخص .
الاستخدام:  بالرد على الشخص او يوزر الشخص او الايدي .

- - - - - - - - - - - - - - - - - - """

TADMIN1 = """

الامر:  `.ك عام`

الشرح:  يستخدم هذا الأمر لكتم الشخص من جميع المجموعات الانته فيها ادمن والخاص .
الاستخدام:  بالرد على الشخص او يوزر الشخص او الايدي .


الامر:  `.الغاء ك عام`

الشرح:  يستخدم هذا الأمر لالغاء كتم الشخص من جميع المجموعات الانته فيها ادمن والخاص .
الاستخدام:  بالرد على الشخص او يوزر الشخص او الايدي .

- - - - - - - - - - - - - - - - - - """

TADMIN1 = """

الامر:  `.ك مؤقت`

الشرح:  يستخدم هذا الأمر لكتم الشخص مؤقتا على حسب المده المحدده .
الاستخدام:  بالرد على الشخص او يوزر الشخص او الايدي .
مثال : `.ك مؤقت @SA3ED_IT 5m` .

m = دقيقه
h = ساعه
d = يوم
w = اسبوع

الامر:  `.الغاء كتم`

الشرح:  يستخدم هذا الأمر لالغاء كتم الشخص .
الاستخدام:  بالرد على الشخص او يوزر الشخص او الايدي .

- - - - - - - - - - - - - - - - - - """


ALIVESLB = """


الامر:  `.سليب`

الشرح:  يستخدم هذا الأمر لجعل الحساب في وضع النوم ويتم ايقافه عبر ارسال رسالة فقط
الاستخدام:  فقط ارسل الأمر مع ذكر السبب او بدون سبب في اي دردشة

- - - - - - - - - - - - - - - - - - """

YIOFDD = """


الامر:   `.نتائج`

الشرح:  لارسال رابط ومعلومات حول فيديو معين من اليوتيوب
الاستخدام:  بكتابة الامر مع عنوان للبحث

- - - - - - - - - - - - - - - - - - """

ITBUTT = """


الامر:   `.زر`

الشرح:  لانشاء ازرار شفافه عن طريق البوت المساعد .
الاستخدام:  `.زر <text> [اسم الزرار]<buttonurl:لينك الزرار>`

مثال: `.زر تليثون ايطاليا [المطور]<buttonurl:https://t.me/SA3ED_IT>`

- - - - - - - - - - - - - - - - - - """

DKZUTOPIC = """

الامر:   `.الصورة الوقتية`

الشرح يقوم بوضع وقت مع صورة الحساب الخاص بك 
الاستخدام:  فقط اكتب الامر وارسله
- - - - - - - - - - - - - - - - - - """

BIOEIDS = """

الامر:   `.بايو وقتي`

الشرح يقوم بوضع وقت مع البايو الخاص بك 
الاستخدام:  فقط اكتب الامر وارسله
- - - - - - - - - - - - - - - - - - """


GROIPSDE = """


الامر:   `.دردشة وقتية`

الشرح:  لوضع وقت ساعة مع المجموعة او القناة الخاصة بك لايقاف الامر ارسل انهاء دردشة وقتية
الاستخدام:  بكتابة الامر و ارساله ي الكروب او القناة

- يستخدم الامر في مجموعة او قناة واحدة

لوضع اسم للمجموعة او القناة مع الوقت بعد استخدام الامر عليك بالرد على اسم المجموعة بالامر  `.وضع الكروب` وبعدها الانتظار الى ان يشتغل السورس

- - - - - - - - - - - - - - - - - - """


PICSERACJ = """ 


الامر:  `.صور`

الشرح:  لتحميل الصور من المتصفح وارسالها لك
الاستخدام:  اكتب الامر مع عدد الصور اقصى حد هو 10 وعنوان البحث

- - - - - - - - - - - - - - - - - - """


STOPTKRARE = """


الامر:   `.ايقاف التكرار`

الشرح:  لأيقاف التكرار لاي امر من اوامر التكرار في جميع الدردشات
الاستخدام:   فقط ارسل الامر في اي دردشة

- - - - - - - - - - - - - - - - - - """


JISORO = """


 ◂  `.تحويل بصمة`
❃ بالرد على المقطع الوصتي لتحويله الى بصمة

 ◂  `.تحويل صوتي`
❃ بالرد على البصمة لتحويلها على شكل مقطع صوتي

- - - - - - - - - - - - - - - - - - """


SAVETECXT = """


الامر: ` .حفظ كتابة `
الامر: ` .حفظ توجيه `

الشرح:  بالرد على اي رسالة ليقوم بحفظها في الرسائل المحفوظة اما بشكل توجيه او بدون توجيه
الاستخدام:  قم بكتابة الأمر بالرد  على الرسالة او الشي التي تريد حفظه

- - - - - - - - - - - - - - - - - - """

CALCATERE = """


الامر: ` .الحاسبة `

الشرح:  لعرض حاسبة علمية للرياضيات 
الاستخدام:  فقط اكتب الامر وارسله

- - - - - - - - - - - - - - - - - - """

IMSLEEPF = """


الامر:  `.سليب_ميديا`

الشرح:  يستخدم هذا الأمر لجعل الحساب في وضع النوم ويتم ايقافه عبر ارسال رسالة فقط
الاستخدام:  اكتب الامر بالرد على صورة ويمكنك وضع سبب السليب مع الامر

- - - - - - - - - - - - - - - - - - """

COROONA = """


الامر: ` .كورونا

الشرح:  لعرض معلومات عن كورونا في بلدك
الاستخدام:  فقط اكتب الامر مع اسم دولتك بالانكليزية

- - - - - - - - - - - - - - - - - - """

ALICES = """


الامر:   `.فحص`

الشرح:  لعرض  معلومات تنصيبك واصدار السورس
الاستخدام:  فقط اكتب الامر وارسله

- - - - - - - - - - - - - - - - - - """

R7ALTIE = """


الامر:   `.حالتي`

الشرح:  لمعرفة الحساب هل هو محظور من ارسال الرسائل في المجموات العامة او الرسائل الخاصة
الاستخدام:  اكتب الامر وارسله فقط

- - - - - - - - - - - - - - - - - - """

AJMTHOEF = """


الامر:   `.الملف لصورة`

الشرح:  لتحويل الصورة التي تكون مرسلة بشكل ملف الى صورة عادية
الاستخدام:  بكتابة الامر بالرد على صورة بشكل ملف

- - - - - - - - - - - - - - - - - - """

HEMAIREF = """

قائمـه اوامر حماية الخاص :

 ◂  `.تشغيل الحماية`
❃ لتشغيل امر الحمايه يستخدم لتحذير المستخدمين عند مراسلتك في الخاص من التكرار

 ◂  `.تعطيل الحماية`
❃ لتعطيل امر الحمايه وعدم تحذير المستخدمين في الخاص

 ◂  `.سماح`او `.س`
❃ يستخدم الامر لقبول الشخص في الخاص وعدم ارسال تحذيرات له بالرد على الشخص

 ◂  `.رفض`او `.ر`
❃ يستخدم لرفض الشخص من الخاص وتحذيره اذا كرر الرسائل وبعدها حظره

 ◂  `.بلوك`
❃ بالرد على المستخدم لحظره من الخاص

 ◂  `.انبلوك`
❃ بالرد على المستخدم لالغاء حظره من الخاص

 ◂  `.المسموح لهم`
❃ اكتب الامر فقط لعرض معلومات عن الاشخاص الذين قبلته في الخاص


- - - - - - - - - - - - - - - - - - """


LTABAMEKF = """


الامر:   `.تحويل لكتابة`

الشرح:  لتحويل ما داخل الملف الى نص عادي
الاستخدام:  بكتابة الامر بالرد على الملف

- - - - - - - - - - - - - - - - - - """


ITESRAZAN = """


الامر:   `.تحويل لملف`

الشرح:  لتحويل النص الى داخل ملف
الاستخدام:  بكتابة الامر مع اسم الملف والرد على نص

- - - - - - - - - - - - - - - - - - """

TOGIDEF = """


الامر:   `.تحويل متحركة`

الشرح:  لتحويل الفيديو الى متحركة
الاستخدام:  بالرد على فيديو بالامر

- - - - - - - - - - - - - - - - - - """


PICYEYS = """


الامر:   `.تحويل ملصق`

الشرح:  لتحويل  الصورة الى ملصق بدون حزمة
الاستخدام:  بالرد على الصورة

- - - - - - - - - - - - - - - - - - """


STIKERPIC = """


الامر:   `.تحويل صورة`

الشرح:  لتحويل الملصق الى صورة
الاستخدام:  بالرد على الملصق

- - - - - - - - - - - - - - - - - - """

VASCHER = """


الامر:   `.فاس`

الشرح:  لتحويل الفيديو او المتحركة ال ملصق متحرك
الاستخدام:  بالرد على فيديو او متحركة

- - - - - - - - - - - - - - - - - - """


TAGE4E = """


 ◂  `.الكل`
❃ لعمل تاك لاخر 100 عضو في المجموعه اكتب الامر مع اي نص تريد

 ◂  `.تبليغ`
❃ لتبليغ المشرفين اذا حصل شيء ما فقط اكتب الامر

 ◂  `.منشن`
❃ بالرد على المستخدم وكتابه شيء مع الامر لعمل تاك داخل الكلمه للمستخدم

- - - - - - - - - - - - - - - - - - """


PROFUIECMD = """ 

قائـمه اوامر البروفايل: 

 ◂  .تغيير اسم
❃ لتغيير اسم حسابك اكتب الاسم مع الامر

 ◂  .تغيير بايو
❃ لتغيير بايو حسابك اكتب البايو مع الامر 

 ◂  .تغيير صورة
❃ لتغيير صورة حسابك بالرد على الصورة بالامر

 ◂  .تغيير معرف
❃ لتغيير معرف حسابك اكتب المعرف مع الامر

 ◂  .ازالة الصورة
❃ اكبت الامر لحذف صورة حسابك

 ◂  .معرفاتي
❃ لعرض معرفات حسابك التي صنعتها

 ◂  .حسابي
❃ لعرض معلومات و احصائيات حسابك


- - - - - - - - - - - - - - - - - - """


SACAMF = """


 ◂  .وهمي كتابه
❃ لبدء وضع كتابة بشكل وهمي جربه بنفسك

 ◂  .وهمي فيديو
❃ لبدء وضع ارسال فيديو بشكل وهمي جربه بنفسك

 ◂  .وهمي لعبه
❃ لبدء وضع ارسال لعبة بشكل وهمي جربه بنفسك

 ◂  .وهمي صوتي
❃ لبدء وضع ارسال بصمة صوتية بشكل وهمي جربه بنفسك

- - - - - - - - - - - - - - - - - - """


KTABAFE = """ 


 ◂  `.تغميق`
❃ بالرد على الكلام لجعله بشكل غامق

 ◂  `.نسخ`
❃ بالرد على الكلام لجعله بشكل للنسخ

 ◂  `.مائل`
❃ بالرد على الكلام لجعله بشكل مائل

- - - - - - - - - - - - - - - - - - """


SALACMD = """


الامر:   `.صلاة`

الشرح:  لمعرفة اوقات الصلاة من الظهر و المغرب و العصر و العشاء والخ
الاستخدام:  اكت الامر مع اسم محافظتك باللغة الانكليزية

- - - - - - - - - - - - - - - - - - """


DATECMD = """


الامر:   `.ذاتية`

الشرح:  لحفظ الصورة ذاتية التدمير او الصورة الموقوتة في الرسائل المحفوظة بدون علم الطرف الثاني
الاستخدام:  بالرد على صورة ذاتية التدمير

- - - - - - - - - - - - - - - - - - """

ALICVEINLI = """


الامر:   `.السورس`

الشرح:  لعرض  معلومات تنصيبك واصدار السورس بشكل انلاين
الاستخدام:  فقط اكتب الامر وارسله

- - - - - - - - - - - - - - - - - - """


PINGSMC = """


الامر:   `.بنك`

الشرح:  لعرض  معلومات وسرعة الانترنت في البوت الخاص بك
الاستخدام:  فقط اكتب الامر وارسله

- - - - - - - - - - - - - - - - - - """

ALNTDOS = """


الامر:   `.الانترنت صورة`

الشرح:  لعرض  معلومات وسرعة الانترنت في البوت الخاص بك
الاستخدام:  فقط اكتب الامر وارسله

- - - - - - - - - - - - - - - - - - """

# اوامر الادمن
ALIVEBand = """ 


الامر:  `.حظر`

الشرح:  لحظر المستخدم من المجموعة التي انت فيها مشرف 
الاستخدام:  يجب عليك الرد على الشخص لحظره او وضع ايديه او معرفه مع الامر

- - - - - - - - - - - - - - - - - - """

ALIVESOR = """ 


الامر:  `.الصورة -حذف`

الشرح:  لحذف صورة المجموعة يجب ان تكون مشرف
الاستخدام:  فقط أرسل الامر في المجموعة 

- - - - - - - - - - - - - - - - - - """

ALIVEsod = """

الامر:  `.الصورة -وضع `

الشرح:  لوضع الصورة في المجموعة يجب ان تكون مشرف
الاستخدام:  يجب عليك الرد على الصورة المراد وضعها

- - - - - - - - - - - - - - - - - - """

ALIVEunban = """


الامر:   `.الغاء الحظر`

الشرح:  لإلغاء حظر الشخص من المجموعة 
الاستخدام:  قم بالرد على المستخدم او وضع ايديه او معرفه مع الامر

- - - - - - - - - - - - - - - - - - """

ALIVEcatm = """


الامر:   `.كتم`

الشرح: لكتم الشخص من إرسال الرسائل في المجموعة و الخاص 
الاستخدام:  يجب عليك الرد على الشخص او وضع معرفه او ايديه مع الامر

- - - - - - - - - - - - - - - - - - """


ALIVEuncatm = """


الامر:   ` .الغاء كتم `

الشرح:  لالغاء كتم الشخص في المجموعة او الخاص
الاستخدام: بالرد على المستخدم بالامر او وضع معرفه او ايده مع الامر

- - - - - - - - - - - - - - - - - - """

ALIVEbin = """


الامر:  `.تثبيت`

الشرح: لتثبيت الرسالة في الدردشة الحالية
الاستخدام:  بالرد على الرسالة المراد تثبيته

- - - - - - - - - - - - - - - - - - """

ALIVEunbin = """


الامر:  `.الغاء تثبيت`

الشرح:  للغاء تثبيت الرسالة في الدردشة
الاستخدام: يجب عليك الرد على الرسالة التي تريد الغاء تثبيتها

- - - - - - - - - - - - - - - - - - """

ALIVEadmin = """

الامر: ` .رفع ادمن`

الشرح:  يرفع الشخص مشرف في المجموعة
الاستخدام:  قم بالرد على المستخدم او وضع معرفه مع الامر لرفعه مشرف يمكنك وضع لقب بكتاب اللقب مع الامر

- - - - - - - - - - - - - - - - - - """

ALIVEtnadmin = """


الامر: ` .تنزيل ادمن`

الشرح:  تنزيل المستخدم من الاشراف في المجموعة 
الاستخدام:  بالرد على المستخدم او وضع معرفه او ايديه مع الامر لتنزيله من المشرفين

- - - - - - - - - - - - - - - - - - """

ALIVErfe = """ 


الامر:  `.ارفع`

الشرح:   يرفع الشخص مشرف في جميع المجموعات التي تكون بها مشرف
الاستخدام:  يجب عليك الرد على المستخدم او وضع معرفه او ايديه مع الامر 

- - - - - - - - - - - - - - - - - - """

ALIVEnzl = """ 


الامر:  `.نزل`

الشرح:  تنزيل المشرف من جميع المجموعات بشكل عام
الاستخدام:  يجب عليك الرد على المستخدم او وضع معرفه او ايديه مع الامر 

- - - - - - - - - - - - - - - - - - """


ALIVEADV = """ 


الامر:  `.الاحداث`

الشرح:  لعرض اخر الرسائل المحذوفة في المجموعة
الاستخدام:  فقط اكتب الامر في المجموعة.

- - - - - - - - - - - - - - - - - - """

ALIVETFL = """ 


الامر:  `.تفليش`

الشرح:  لحظر جميع الأعضاء في المجموعة يجب ان تكون لديك صلاحيات حظر
الاستخدام:  فقط ارسل الامر في المجموعة

- - - - - - - - - - - - - - - - - - """


ALIVEgma = """ 


الامر:  `.تنزيل الكل`

الشرح:  تنزيل جميع المشرفين من الاشراف في المجموعة 
الاستخدام:  فقط اكتب الامر في المجموعة

- - - - - - - - - - - - - - - - - - """


ALIVEMHA = """ 


الامر:  `.المحظورين`

الشرح:  لعرض جميع المحظورين في المجموعة 
الاستخدام:  فقط ارسل الامر في المجموعة

- - - - - - - - - - - - - - - - - - """


KICKCMD = """ 


الامر:  `.طرد`

الشرح:  يقوم بطرد المستخدم من المجموعة
الاستخدام:  يجب عليك الرد على المستخدم او وضع معرفه او ايديه مع الامر 

- - - - - - - - - - - - - - - - - - """


UPDATE4E = """ 


الامر:  `.تحديث`

الشرح:  يقوم بتحديث ملفات السورس عند نزول تحديث في القناة
الاستخدام:  فقط ارسل الاملا

- - - - - - - - - - - - - - - - - - """


ALIVETHR = """ 


الامر:  `.تحذير`

الشرح:  يقوم بتحذير المستخدم في المجموعة واذا وصلت 3 تحذيرات يطرده
الاستخدام:  يجب عليك الرد على المستخدم او وضع معرفه او ايديه مع الامر 

- - - - - - - - - - - - - - - - - - """


ALIVEunTHR = """ 


الامر: ` .حذف التحذيرات `

الشرح:  يقوم بحذف جميع تحذيرات المستخدم 
الاستخدام:  يجب عليك الرد على المستخدم 

- - - - - - - - - - - - - - - - - - """


ALIVETSV = """ 


الامر:  `.التحذيرات`

الشرح:  يقوم بعرض تحذيرات المستخدم 
الاستخدام:  يجب عليك الرد على المستخدم او وضع معرفه او ايديه مع الامر 

- - - - - - - - - - - - - - - - - - """

# الاذاعة
BRWAADV1 = """ 


الامر:  `.للجروبات`

الشرح:  يقوم بعمل اذاعة لجميع المجموعات في حسابك لرسالتك
الاستخدام:  يجب عليك الرد على الرسالة المراد اذاعتها بالامر

- - - - - - - - - - - - - - - - - - """


BROADEV1 = """ 


الامر:  ` .للخاص `

الشرح:  يقوم بعمل اذاعة لجميع الرسائل الخاصة في حسابك لرسالتك
الاستخدام:  يجب عليك الرد على الرسالة المراد اذاعتها بالامر

- - - - - - - - - - - - - - - - - - """

ADDMEM7 = """ 


الامر:  `.ضيف`

الشرح:  يقوم بأضافة الأعضاء من مجموعة الى مجموعة أخرى 
الاستخدام:  تذهب الى مجموعتك وتكتب الانر مع رابط المجموعة المراد اخذ الاعضاء منها

- - - - - - - - - - - - - - - - - - """

# اعادة
ALIVEAUD = """ 


الامر:  `.اعادة تشغيل`

الشرح:  لاعادة تشغيل سورس جمثون
الاستخدام:  اكتب الامر في اي دردشة

- - - - - - - - - - - - - - - - - - """

# فلم
ALIVEflm = """ 


الامر:  ` .فلم `

الشرح:   للبحث عن معلومات فلم معين وارساله لك
الاستخدام:  بوضع اسم الفلم باللغة الانكليزية مع الامر 

- - - - - - - - - - - - - - - - - - """

# الانتحال
CLIONEACMD = """ 



الامر:  `.انتحال`

الشرح:  لأنتحال المستخدم ونسخ صورته واسمه والبايو الخاص به
الاستخدام:  يجب عليك الرد على المستخدم او وضع معرفه او ايديه مع الامر 

- - - - - - - - - - - - - - - - - - """


ALIVEMEE = """ 


الامر:  `.الغاء الانتحال`

الشرح:  لأرجاع حسابك الى وضعه السابق من اسم وصورة ونبذة
الاستخدام:  فقط ارسل الامر في اي دردشة

- - - - - - - - - - - - - - - - - - """

# الايدي
ALIVEDIII = """ 


الامر:  `.الايدي`

الشرح:  لعرض ايدي المجموعة او المستخدم
الاستخدام:  بالرد على المستخدم لعرض ايديه او ارساله فقط لعرض ايدي المجموعة

- - - - - - - - - - - - - - - - - - """

# بحث
ALIVETSM = """ 



الامر:  `.بحث`

الشرح:  للتحميل من اليوتيوب على صيغة ملف صوتي
الاستخدام:  بكتابة عنوان للمقطع الصوتي مع الامر لتحميله لك

- - - - - - - - - - - - - - - - - - """


ALIVEFDO = """ 



الامر:  `.تيك توك`

الشرح:  للتحميل من التيك توك
الاستخدام:  بكتابة عنوان الفيديو مع الامر لتحميله لك بشكل مباشر

- - - - - - - - - - - - - - - - - - """

# اوامر وضع
ALIVEBIO = """ 


الامر:  `.وضع بايو`

الشرح:  لتغيير النبذة او البايو الخاص بحسابك
الاستخدام:  بكتابة الامر والرد على البايو او النبذة الجديدة

- - - - - - - - - - - - - - - - - - """


ALIVESAM = """ 


الامر:  `.وضع اسم`

الشرح:  لتغيير اسم حسابك شش
الاستخدام:  بكتابة الامر والرد على الاسم الجديد

- - - - - - - - - - - - - - - - - - """


ALIVEsor = """ 



الامر:  `.وضع صورة`

الشرح:  لتغيير صورة حسابك الشخصية
الاستخدام:  بكتابة الامر والرد على الصورة الجديدة

- - - - - - - - - - - - - - - - - - """


ALIVEOZR = """ 


الامر:   `.وضع يوزر`

الشرح:  لتغيير المعرف او اليوزر الخاص بحسابك
الاستخدام:  بكتابة الامر والرد على المعرف او اليوزر الجديد

- - - - - - - - - - - - - - - - - - """

# بنك
ALIVEBIK = """ 


الامر:  `.بنك`

الشرح:  امر بسيط لعرض سرعة الاستجابه لديك
الاستخدام:  فقط ارسل الامر في اي دردشة كانت

- - - - - - - - - - - - - - - - - - """

# ترجمه
ALIVETRG = """


الامر: ` .ترجمة `

الشرح:  يترجم لك الكلام انكليزي العربي والخ
الاستخدام:  قم بكتابة الأمر بالرد على الرساله مع كود الترجمه مثال (.ترجمه ar) 

- - - - - - - - - - - - - - - - - - """

# ترحيب
ALIVETRSB = """ 


الامر:  `.ترحيب`

الشرح:  يقوم بترحيب الاعضاء للجدد في المجموعة 
الاستخدام:  كتابة الامر مع الترحيب وارساله في المجموعة

- - - - - - - - - - - - - - - - - - """


ALIVEundf = """ 


الامر:   `.حذف الترحيب`

الشرح:  يقوم بحذف الترحيب في المجموعة وايقافه
الاستخدام:  فقط اكتب الامر في المجموعة المراد ايقاف الترحيب بها

- - - - - - - - - - - - - - - - - - """


ALIVETRS = """ 


الامر:  `.الترحيبات`

الشرح:  يقوم بعرض لك الترحيبات في المجموعة 
الاستخدام:  فقط اكتب الامر في المجموعة

- - - - - - - - - - - - - - - - - - """

# تقليد
ADDTKLED = """ 


الامر:  `.ازعاج`

الشرح:  يقوم بتقليد جميع رسائل المستخدم في الدردشة التي استخدمت بها الامر
الاستخدام:  يجب عليك الرد على المستخدم او وضع معرفه او ايديه مع الامر 

- - - - - - - - - - - - - - - - - - """

NOAZAJ4 = """ 


الامر:  `.حذف المقلدهم`

الشرح:  يقوم بالغاء التقليد على جميع المستخدمين في الدردشة
الاستخدام:  فقط ارسل الامر في الدردشة

- - - - - - - - - - - - - - - - - - """

STOPAZAG = """ 


الامر:   `.الغاء الازعاج`

الشرح:  يقوم بإلغاء تقليد رسائل المستخدم في الدردشة
الاستخدام:  يجب عليك الرد على المستخدم او وضع معرفه او ايديه مع الامر 

- - - - - - - - - - - - - - - - - - """

ALMKD5D = """ 


الامر:  `.المقلدهم`

الشرح:  يقوم بعرض الاشخاص الذي قمت بتقليدهم في الدردشة
الاستخدام:  فقط ارسل الامر في الدردشة

- - - - - - - - - - - - - - - - - - """


# تلكراف
TELEHTMED = """ 


الامر:  `.تليجراف م`

الشرح:  لعمل رابط تيليجراف للصورة 
الاستخدام: بالرد على الصورة المراد عمل الرابط لها

- - - - - - - - - - - - - - - - - - """


MLKEACMD = """


الامر:   `.تحويل ملكية`

الشرح:  لتحويل ملكية الكروب او القناة الى شخص اخر
الاستخدام:   كتابه الامر مع معرف الشخص وارساله في القناة

- - - - - - - - - - - - - - - - - - """


TKRAR3ADI = """


الامر:   `.كرر`

الشرح:  ليقوم بتكرار الرسالة بشكل اعتيادي
الاستخدام:   كتابه الامر مع عدد التكرار والرد على الرسالة لتكرارها

- - - - - - - - - - - - - - - - - - """

SPAM3AAH = """


الامر:   `.سبام`

الشرح:  ليقوم بارسال احرف الكلمة حرف حرف
الاستخدام:   كتابه الامر مع الكلمة او الرد عليها

- - - - - - - - - - - - - - - - - - """

FGKHEF8 = """


الامر:   `.وسبام`

الشرح:  ليقوم بارسال كلمات الجمله كلمة كلمة
الاستخدام:   كتابه الامر مع الجملة او الرد على الجملة بالامر

- - - - - - - - - - - - - - - - - - """

MKRRR5 = """


الامر:   `.مكرر`

الشرح:  ليقوم بالتكرار للرسالة مع وجود مدة زمنية بين ارسال كل رسالة
الاستخدام:   كتابه الامر مع عدد التكرار و عدد الثواني بين كل ارسال والرد على الرسالة

- - - - - - - - - - - - - - - - - - """

# تغيرها حسب الامر
ALMN3CMD = """


الامر:   `.منع`

الشرح:  لمنع كلمة ومسحها عند ارسالها في الدردشة
الاستخدام:  كتابة الامر مع الكلمة الذي تريد منعها

- - - - - - - - - - - - - - - - - - """

A3ALMN3 = """


الامر:   `.الغاء منع`

الشرح:  لالغاء منع كلمة والسماح بها عند ارسالها في الدردشة
الاستخدام:  كتابة الامر مع الكلمة الذي تريد الغاء منعها

- - - - - - - - - - - - - - - - - - """

LISTBLCK = """


الامر:   `.قائمة المنع`

الشرح:  لعرض الكلمات التي منعت في الدردشة
الاستخدام:  فقط اكتب الامر وارسله

- - - - - - - - - - - - - - - - - - """

MEMCMD = """


الامر:   `.عيد`

الشرح:  بقوم بأعادة ارسال الرسالة في الدردشة
الاستخدام:  كتابة الامر والرد على الرسالة

- - - - - - - - - - - - - - - - - - """

MEMCMD = """


الامر:   `.فصخ`

الشرح:  يقوم بتجزيء الكلام بشكب احرف جربه بنفسك
الاستخدام:  بكتابة الامر مع الكلمه او الرد عليها

- - - - - - - - - - - - - - - - - - """

ALN6KCMD = """


الامر:   `.انطق ar`

الشرح:  لنطق كلام في بصمه صوتية
الاستخدام:  كتابة الامر مع الكلمة الذي تريد انطقها

- - - - - - - - - - - - - - - - - - """

ALWKTECMD = """


الامر:   `.الساعه`

الشرح:  ليقوم بوضع وقت ساعة مع اسمك في حسابك،  يجب عليك وضع اسمك في خانة العائلة
الاستخدام:  فقط اكتب الامر وارسله

الامر:   `.تعطيل الساعه`

الاستخدام: لتعطيل الساعه .
- - - - - - - - - - - - - - - - - - """

BENTRSTCMD = """


الامر:   `.بينترست`

الشرح:  لتحميل فيديو او صورة من موقع بينترست
الاستخدام:  بكتابة الامر الرابط

- - - - - - - - - - - - - - - - - - """

TSLEACMD = """

اهلا بك عزيزي المستخدم في  قائـمة اوامر التسلية:

`.غبي`      `.نعم`
`.مربعات`  `.حلويات`
`.نار`    `.افكر`
`.متت`   `.مضايق`
`.ساعه`      `.مح`
`.قلب`     `.جيم`
`.الارض`     `.قمر`
`.اقمار`    `.قمور`
`.فراشه`     `.مطر`
`.تفريغ`    `.احبك`
`.طائره`    `.شرطه`
`.النظام الشمسي`
ٴ╼──────────────────╾ """


RSTOPRD = """


الامر:   `.حذف رد`

الشرح:  لحذف رد معين من المجموعة وايقافه
الاستخدام:  بكتابة الامر مع الرد المراد ايقافه

- - - - - - - - - - - - - - - - - - """


MELICLW = """


الامر:   `.اطردني`

الشرح:  لمغادرة المجموعة التي استخدمت الامر بها
الاستخدام:  بكتابة الامر وارساله في المجموعة التي تريد مغادرتها

- - - - - - - - - - - - - - - - - - """

ALMSHRFE1 = "قائمـه اوامر المجموعة :\n\n ◂  `.المشرفين` \n❃ فقط اكتب الامر في المجموعه لعرض مشرفين المجموعه\n\n ◂  `.البوتات` \n❃ فقط اكتب الامر في الدردشة لعرض البوتات المضافة \n\n ◂  `.الاعضاء`\n❃ فقط اكتب الامر في المجموعه لعرض أعضاء الدردشة\n\n ◂  `.معلومات`\n❃ لعرض معلومات المجموعه اكتبه الامر في المجموعة"

ACCD5SS = """


الامر:   `.المحذوفين`

الشرح:  لعرض الحسابات المحذوفة في المجموعة وتنظيفها
الاستخدام:  فقط ارسل الامر في المجموعة

- - - - - - - - - - - - - - - - - - """


ALLRD5 = """


الامر:   `.الردود`

الشرح:  لعرض جميع الردود المضافة في الدردشة
الاستخدام:  بكتابة الامر وارساله في المجموعة

- - - - - - - - - - - - - - - - - - """


ALLRDSTOP = """


الامر:   `.حذف الردود`

الشرح:  لحذف جميع الردود المضافة في المجموعة
الاستخدام:  بكتابة الامر وارساله في المجموعة

- - - - - - - - - - - - - - - - - - """


RDAJFDA = """


الامر:   `.رد`

الشرح:  لاضافة رد في الدردشة المستخم بها الامر
الاستخدام:  بكتابة الامر مع كلمة الرد و جملة الرد

- - - - - - - - - - - - - - - - - - """

TTBEKCMD = """


الامر:   `.تطبيق`

الشرح:  لبحث على تطبيق في كوكل بلي وارسال معلوماته 
الاستخدام:  بكتابة الامر واسم التطبيق فقط

- - - - - - - - - - - - - - - - - - """

UNBLOCKCMD = """


الامر:   `.فك المحظورين`

الشرح:  لفك المستخدمين المحظورين من حسابك 
الاستخدام:  فقط اكتب الامر وارسله

- - - - - - - - - - - - - - - - - - """

UMBLCTR = """


الامر:   `.الغاء المحظورين`

الشرح:  لفك المستخدمين المحظورين من المجموعة
الاستخدام:  فقط اكتب الامر وارسله في المجموعة

- - - - - - - - - - - - - - - - - - """

TRFEHCMD = """

اهلا بك عزيزي المستخدم في قائـمه اوامر الترفيه:

• جميع هذه الاوامر تستخدم بالرد على الشخص كترفيه
◂  .رفع مطي
◂  .رفع كلب
◂  .رفع حيوان
◂  .رفع زاحف
◂  .رفع مرتي
◂  .رفع زوجي
◂  .رفع تاج
◂  .رفع بكلبي
◂  .رفع بزون
◂  .رفع قرد

◂  .نسبة الحب
◂  .نسبة الانوثة
◂  .نسبة الرجولة
◂  .نسبة الغباء
◂  .نسبة المثْلية

◂  .كت
◂  .اوصف
◂  .هينه
◂  .نزوج
◂  .طلاك

- - - - - - - - - - - - - - - - - - """

MLFATCMD = """


الامر:   `.تنصيب`

الشرح:  لتنصيب ملف ما في جمثون
الاستخدام:  كتابة الامر ولرد على الملف

- - - - - - - - - - - - - - - - - - """

ALTKRARCMD = """


الامر:   `.ضع التكرار`

الشرح:  لمنع التكرار في المجموعة وتقييد المستخدم عند التكرار
الاستخدام:  كتابة الامر مع عدد التكرار

• لأيقاف التكرار استخدم الامر مع عدد كبير جدا 

- - - - - - - - - - - - - - - - - - """

YOUTUBECMD = """


الامر:   `.تحميل صوتي`

الشرح:  لتحميل من اليوتيوب الفيديو بشكل ملف صوتي
الاستخدام:  كتابة الامر مع رابط الفيديو

- - - - - - - - - - - - - - - - - - """

YOUTUBECCMD = """


الامر:   `.تحميل فيديو`

الشرح:  لتحميل من اليوتيوب او العديد من مواقع التواصل بشكل فيديو
الاستخدام:  كتابة الامر ورابط الفيديو

- - - - - - - - - - - - - - - - - - """

INSTAGRAMCMD = """


الامر:   `.انستا`

الشرح:  لتحميل بوست او ريلز من انستا
الاستخدام:  كتابة الامر ورابط الذي تريد تحميله من انستا

- - - - - - - - - - - - - - - - - - """

ALKROBCMD = """


الامر:   `.الاعضاء`

الشرح:  لجلب معرفات الاعضاء في المجموعة
الاستخدام:  فقط اكتب الامر وارسله

- - - - - - - - - - - - - - - - - - """

ALKROBCMD = """


الامر:   `.المشرفين`

الشرح:  لجلب المشرفين في المجموعة
الاستخدام:  فقط اكتب الامر وارسله

- - - - - - - - - - - - - - - - - - """

TEXTCMD = """


الامر:   `.نسخ`

الشرح:  لنسخ الذي تم رد عليه
الاستخدام:  كتابة الامر مع الرد على الكلام

- - - - - - - - - - - - - - - - - - """

TEXTCMD = """


الامر:   `.تغميق`

الشرح:  لتغميق الرسالة الذي تم الرد عليه
الاستخدام:  كتابة الامر مع الرد على الرسالة 

- - - - - - - - - - - - - - - - - - """

TEXTCMD = """


الامر:   `.مائل`

الشرح:  لعمل الرسالة بشكل مائل
الاستخدام:  كتابة الامر مع الرد على الرسالة

- - - - - - - - - - - - - - - - - - """

KSHFCMD = """


الامر:   `.ايدي`

الشرح:  لعرض  معلوماتك او معلومات المستخدم الذي تم الرد عليه
الاستخدام:  كتابة الامر بالرد على المستخدم او وضع معرفه او ايديه مع الامر

- - - - - - - - - - - - - - - - - - """
